#include"List.h"
void Menu()
{
    cout<<endl;
    cout<<" ____________________________________________"<<endl;
    cout<<"|                  主菜单                    |"<<endl;
    cout<<"|                                            |"<<endl;
    cout<<"|                1.新建文件                  |"<<endl;
    cout<<"|                2.读取文件                  |"<<endl;
    cout<<"|                3.显示数据                  |"<<endl;
    cout<<"|                4.数据排序                  |"<<endl;
    cout<<"|                5.数据筛选                  |"<<endl;
    cout<<"|                6.数据筛选定位              |"<<endl;
    cout<<"|                0.退出                      |"<<endl;
    cout<<"|____________________________________________|"<<endl;
}

void Help()
{
    cout<<"--------------------------------------------------------"<<endl;
    cout<<"1.新建文件\n";
    cout<<"从当前目录装入文件data.txt\n";
    cout<<"2.读取文件\n";
    cout<<"从当前目录读取文件data.txt，若当前目录没有，则提示错误\n";
    cout<<"3.显示数据\n";
    cout<<"将全部列显示\n";
    cout<<"4.数据排序\n";
    cout<<"按成绩(grade)降序排序\n";
    cout<<"类似地，还可以是学号、姓名、性别、省份、出生年月日\n";
    cout<<"5.数据筛选\n";
    cout<<"显示学号、姓名\n";
    cout<<"只显示学号、姓名两列，显示的列还可以是其他任意\n";
    cout<<"6.数据筛选定位\n";
    cout<<"成绩>60 性别=男\n";
    cout<<"筛选出（成绩>60 性别=男）的学生，所要显示的列可自定义\n";
    cout<<"--------------------------------------------------------"<<endl;

}